In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
demo1 = pd.read_csv('api_data_aadhar_demographic_0_500000.csv')
demo2 = pd.read_csv('api_data_aadhar_demographic_500000_1000000.csv')
demo3 = pd.read_csv('api_data_aadhar_demographic_1000000_1500000.csv')
demo4 = pd.read_csv('api_data_aadhar_demographic_1500000_2000000.csv')
demo5 = pd.read_csv('api_data_aadhar_demographic_2000000_2071700.csv')

In [3]:
demo_combined = pd.concat([demo1,demo2,demo3,demo4,demo5], ignore_index = True)

In [4]:
df = demo_combined.copy()

In [5]:
df.shape

(2071700, 6)

In [6]:
df.head(4)

,date,state,district,pincode,demo_age_5_17,demo_age_17_
0,01-03-2025,Uttar Pradesh,Gorakhpur,273213,49,529
1,01-03-2025,Andhra Pradesh,Chittoor,517132,22,375
2,01-03-2025,Gujarat,Rajkot,360006,65,765
3,01-03-2025,Andhra Pradesh,Srikakulam,532484,24,314

In [7]:
df.isnull().sum()

date             0
state            0
district         0
pincode          0
demo_age_5_17    0
demo_age_17_     0
dtype: int64

In [8]:
df.describe()

            pincode  demo_age_5_17  demo_age_17_
count  2.071700e+06   2.071700e+06  2.071700e+06
mean   5.278318e+05   2.347552e+00  2.144701e+01
std    1.972933e+05   1.490355e+01  1.252498e+02
min    1.000000e+05   0.000000e+00  0.000000e+00
25%    3.964690e+05   0.000000e+00  2.000000e+00
50%    5.243220e+05   1.000000e+00  6.000000e+00
75%    6.955070e+05   2.000000e+00  1.500000e+01
max    8.554560e+05   2.690000e+03  1.616600e+04

In [9]:
df.dtypes

date             object
state            object
district         object
pincode           int64
demo_age_5_17     int64
demo_age_17_      int64
dtype: object

In [10]:
df.rename(columns = {
    'demo_age_17_' : 'age_17_plus_count',
    'demo_age_5_17' : 'age_5_17_count'
}, inplace = True)

In [11]:
df.columns.tolist()

['date', 'state', 'district', 'pincode', 'age_5_17_count', 'age_17_plus_count']

In [12]:
df['date'] = pd.to_datetime(df['date'], dayfirst = True, errors = 'coerce')

In [13]:
df['date'].isna().sum()

np.int64(0)

In [14]:
df.dtypes
# df['date'].min(), df['date'].max()

date                 datetime64[ns]
state                        object
district                     object
pincode                       int64
age_5_17_count                int64
age_17_plus_count             int64
dtype: object

In [15]:
df['pincode'] = df['pincode'].astype(str)

In [16]:
df['state'] = df['state'].str.strip().str.lower()
df['district'] = df['district'].str.strip().str.lower()

In [17]:
df.head(3)

,date,state,district,pincode,age_5_17_count,age_17_plus_count
0,2025-03-01,uttar pradesh,gorakhpur,273213,49,529
1,2025-03-01,andhra pradesh,chittoor,517132,22,375
2,2025-03-01,gujarat,rajkot,360006,65,765

In [18]:
df.duplicated().sum()

np.int64(473688)

In [19]:
df[df.duplicated()].head()

,date,state,district,pincode,age_5_17_count,age_17_plus_count
182369,2025-12-06,odisha,jajpur,755020,0,1
219406,2025-11-10,west bengal,south 24 parganas,743368,0,1
227394,2025-10-26,tamil nadu,krishnagiri,635207,6,17
227395,2025-10-26,tamil nadu,krishnagiri,635306,6,3
227396,2025-10-26,tamil nadu,krishnagiri,635307,5,17

In [20]:
df = df.drop_duplicates().reset_index(drop = True)

In [21]:
df['state'].unique()

array(['uttar pradesh', 'andhra pradesh', 'gujarat', 'rajasthan',
       'karnataka', 'west bengal', 'telangana', 'odisha', 'maharashtra',
       'kerala', 'bihar', 'tamil nadu', 'madhya pradesh', 'assam',
       'tripura', 'arunachal pradesh', 'punjab', 'jharkhand', 'delhi',
       'chandigarh', 'chhattisgarh', 'jammu and kashmir', 'mizoram',
       'nagaland', 'himachal pradesh', 'goa', 'haryana', 'meghalaya',
       'uttarakhand', 'manipur', 'daman and diu', 'puducherry', 'sikkim',
       'ladakh', 'dadra and nagar haveli and daman and diu',
       'dadra and nagar haveli', 'orissa', 'pondicherry',
       'andaman & nicobar islands', 'andaman and nicobar islands',
       'daman & diu', 'west  bengal', 'jammu & kashmir', 'lakshadweep',
       'dadra & nagar haveli', 'westbengal', 'west bangal', 'chhatisgarh',
       'west bengli', 'darbhanga', 'puttenahalli', 'balanagar',
       'uttaranchal', '100000', 'jaipur', 'madanapalle', 'nagpur',
       'raja annamalai puram'], dtype=object)

In [22]:
df['state_clean'] = df['state'].str.lower().str.strip().str.replace(r'[^a-z]', '', regex=True)

In [29]:
valid_states = [
    "andhrapradesh","arunachalpradesh","assam","bihar","chhattisgarh",
    "goa","gujarat","haryana","himachalpradesh","jharkhand",
    "karnataka","kerala","madhyapradesh","maharashtra","manipur",
    "meghalaya","mizoram","nagaland","odisha","punjab",
    "rajasthan","sikkim","tamilnadu","telangana","tripura",
    "uttarpradesh","uttarakhand","westbengal",
    "jammuandkashmir","delhi"
]

from rapidfuzz import process
unique_state = df['state_clean'].unique()

mapping = {
    messy: process.extractOne(messy, valid_states, score_cutoff = 75)[0]
    if process.extractOne(messy, valid_states, score_cutoff = 75) else messy
    for messy in unique_state
    }

df['state_final'] = df['state_clean'].map(mapping)

In [40]:
df['state_final'].unique()

array(['uttarpradesh', 'andhrapradesh', 'gujarat', 'rajasthan',
       'karnataka', 'westbengal', 'telangana', 'odisha', 'maharashtra',
       'kerala', 'bihar', 'tamilnadu', 'madhyapradesh', 'assam',
       'tripura', 'arunachalpradesh', 'punjab', 'jharkhand', 'delhi',
       'chandigarh', 'chhattisgarh', 'jammuandkashmir', 'mizoram',
       'nagaland', 'himachalpradesh', 'goa', 'haryana', 'meghalaya',
       'uttarakhand', 'manipur', 'dadraandnagarhavelianddamananddiu',
       'puducherry', 'sikkim', 'ladakh', 'andamanandnicobarislands',
       'lakshadweep', 'uttaranchal'], dtype=object)

In [36]:
df['state_final'] = df['state_final'].replace({
    "orissa": "odisha",
    "pondicherry": "puducherry",
    "andamannicobarislands": "andamanandnicobarislands",
    "damananddiu": "dadraandnagarhavelianddamananddiu",
    "damandiu": "dadraandnagarhavelianddamananddiu",
    "dadraandnagarhaveli": "dadraandnagarhavelianddamananddiu",
    "dadranagarhaveli": "dadraandnagarhavelianddamananddiu"
})

In [41]:
df['state_final'].value_counts()

state_final
andhrapradesh                        154789
tamilnadu                            153333
uttarpradesh                         132366
maharashtra                          126303
westbengal                           125013
karnataka                            120403
odisha                                82463
kerala                                82186
gujarat                               75161
bihar                                 74536
telangana                             70098
rajasthan                             68455
madhyapradesh                         60157
assam                                 47408
punjab                                38097
jharkhand                             31225
chhattisgarh                          27288
haryana                               22341
himachalpradesh                       21940
uttarakhand                           17710
jammuandkashmir                       16015
delhi                                  8066
tripura                                6968
manipur                                5745
goa                                    4609
meghalaya                              4180
puducherry                             3810
arunachalpradesh                       3608
nagaland                               3109
mizoram                                3010
sikkim                                 2452
chandigarh                             1536
andamanandnicobarislands               1289
dadraandnagarhavelianddamananddiu      1250
ladakh                                  672
lakshadweep                             410
uttaranchal                               3
Name: count, dtype: int64

In [33]:
df = df[df['state_final'].map(df['state_final'].value_counts())>1]

In [42]:
df = df[df['state_final'].notna()]
df = df[df['state_final'] != '']
df = df[df['state_final'].str.len() > 0]

In [47]:
df.head()

,date,state,district,pincode,age_5_17_count,age_17_plus_count,state_clean,state_final,total_enrolments,day,month,year
0,2025-03-01,uttar pradesh,gorakhpur,273213,49,529,uttarpradesh,uttarpradesh,578,1,3,2025
1,2025-03-01,andhra pradesh,chittoor,517132,22,375,andhrapradesh,andhrapradesh,397,1,3,2025
2,2025-03-01,gujarat,rajkot,360006,65,765,gujarat,gujarat,830,1,3,2025
3,2025-03-01,andhra pradesh,srikakulam,532484,24,314,andhrapradesh,andhrapradesh,338,1,3,2025
4,2025-03-01,rajasthan,udaipur,313801,45,785,rajasthan,rajasthan,830,1,3,2025

In [45]:
df['total_enrolments'] = df['age_5_17_count'] + df['age_17_plus_count']

In [46]:
df['day'] = df['date'].dt.day
df['month'] = df['date'].dt.month
df['year'] = df['date'].dt.year

In [53]:
df.groupby('pincode')['state_final'].nunique().max()

np.int64(1)

In [49]:
bad_pincodes = df.groupby('pincode')['state_final'].nunique()
bad_pincodes = bad_pincodes[bad_pincodes > 1]
bad_pincodes

pincode
140603    2
140901    2
160003    2
160014    2
160055    2
         ..
756084    2
781129    2
781131    2
783123    2
783134    2
Name: state_final, Length: 698, dtype: int64

In [51]:
df[df['pincode'].isin(bad_pincodes.index)][['pincode', 'state_final']].sort_values('pincode')

        pincode state_final
908807   140603      punjab
415178   140603      punjab
885377   140603      punjab
380325   140603      punjab
700202   140603      punjab
...         ...         ...
1145131  783134       assam
104862   783134   meghalaya
646758   783134       assam
1143352  783134       assam
385526   783134   meghalaya

[110743 rows x 2 columns]

In [ ]:
for pin in bad_pincodes.index: 
    correct_state = (df[df['pincode'] == pin]['state_final'].value_counts().idxmax()) 
    df.loc[df['pincode'] == pin, 'state_final'] = correct_state

In [ ]:
df.head()
# data cleaning done

,date,state,district,pincode,age_5_17_count,age_17_plus_count,state_clean,state_final,total_enrolments,day,month,year
0,2025-03-01,uttar pradesh,gorakhpur,273213,49,529,uttarpradesh,uttarpradesh,578,1,3,2025
1,2025-03-01,andhra pradesh,chittoor,517132,22,375,andhrapradesh,andhrapradesh,397,1,3,2025
2,2025-03-01,gujarat,rajkot,360006,65,765,gujarat,gujarat,830,1,3,2025
3,2025-03-01,andhra pradesh,srikakulam,532484,24,314,andhrapradesh,andhrapradesh,338,1,3,2025
4,2025-03-01,rajasthan,udaipur,313801,45,785,rajasthan,rajasthan,830,1,3,2025